#Выведите число «пи» (π) с точностью до 
#5 знаков.

import math 
#number = int(input('Enter number:
result = math.pi
print(result)